; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-8-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-6 - location
	p1-2 - location
	p1-3 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p4-0 - location
	p4-2 - location
	p4-3 - location
	p4-5 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s0)
	(at driver5 s3)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s5)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s1)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s5)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s5)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s4)
	(at package2 s0)
	(at package3 s6)
	(at package4 s2)
	(at package5 s5)
	(at package6 s2)
	(at package7 s5)
	(at package8 s2)
	(at package9 s1)
	(at package10 s3)
	(at package11 s5)
	(at package12 s3)
	(at package13 s2)
	(at package14 s2)
	(at package15 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 62)
	(= (time-to-drive s3 s0) 62)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 4)
	(= (time-to-drive s3 s1) 4)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 60)
	(= (time-to-drive s3 s2) 60)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 4)
	(= (time-to-drive s5 s2) 4)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 92)
	(= (time-to-drive s1 s4) 92)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 48)
	(= (time-to-drive s6 s4) 48)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 78)
	(= (time-to-drive s0 s5) 78)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 54)
	(= (time-to-drive s1 s5) 54)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 53)
	(= (time-to-drive s3 s5) 53)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 57)
	(= (time-to-drive s4 s5) 57)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 48)
	(= (time-to-drive s6 s5) 48)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 93)
	(= (time-to-drive s1 s6) 93)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver3 s1)
	(at driver4 s2)
	(at driver5 s0)
	(at truck1 s1)
	(at truck2 s1)
	(at truck3 s5)
	(at truck4 s3)
	(at truck5 s0)
	(at truck6 s1)
	(at truck8 s5)
	(at package1 s6)
	(at package2 s3)
	(at package3 s5)
	(at package4 s4)
	(at package5 s1)
	(at package6 s2)
	(at package7 s1)
	(at package8 s2)
	(at package9 s1)
	(at package11 s4)
	(at package12 s4)
	(at package13 s4)
	(at package14 s6)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver5 truck3 s3)
   deleted: (at driver5 s3) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 6 of 24
2. (drive-truck truck3 s3 s5 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 0 to 530
   goals met: 7 of 24
3. (load-truck package5 truck3 s5)
   deleted: (at package5 s5)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 24
4. (load-truck package7 truck3 s5)
   deleted: (at package7 s5)
   added: (in package7 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 7 of 24
5. (load-truck package11 truck3 s5)
   deleted: (at package11 s5)
   added: (in package11 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 7 of 24
6. (drive-truck truck3 s5 s0 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 530 to 1778
   goals met: 6 of 24
7. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 6 of 24
8. (drive-truck truck3 s0 s3 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (fuel-used) from 1778 to 3018
   goals met: 6 of 24
9. (unload-truck package2 truck3 s3)
   deleted: (in package2 truck3)
   added: (at package2 s3)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 7 of 24
10. (load-truck package12 truck3 s3)
   deleted: (at package12 s3)
   added: (in package12 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 7 of 24
11. (drive-truck truck3 s3 s0 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 3018 to 4258
   goals met: 7 of 24
12. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 24
13. (load-truck package13 truck1 s2)
   deleted: (at package13 s2)
   added: (in package13 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 24
14. (load-truck package14 truck1 s2)
   deleted: (at package14 s2)
   added: (in package14 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 7 of 24
15. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 7 of 24
16. (drive-truck truck3 s0 s5 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 4258 to 5818
   goals met: 8 of 24
17. (drive-truck truck1 s2 s5 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (fuel-used) from 5818 to 5882
   goals met: 8 of 24
18. (drive-truck truck1 s5 s4 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (fuel-used) from 5882 to 6794
   goals met: 8 of 24
19. (unload-truck package13 truck1 s4)
   deleted: (in package13 truck1)
   added: (at package13 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 9 of 24
20. (unload-truck package4 truck1 s4)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 10 of 24
21. (load-truck package1 truck1 s4)
   deleted: (at package1 s4)
   added: (in package1 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 10 of 24
22. (drive-truck truck1 s4 s6 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 6794 to 7418
   goals met: 10 of 24
23. (unload-truck package14 truck1 s6)
   deleted: (in package14 truck1)
   added: (at package14 s6)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 11 of 24
24. (unload-truck package1 truck1 s6)
   deleted: (in package1 truck1)
   added: (at package1 s6)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 12 of 24
25. (load-truck package3 truck1 s6)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 12 of 24
26. (drive-truck truck1 s6 s1 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 7418 to 8441
   goals met: 13 of 24
27. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 14 of 24
28. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 14 of 24
29. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 13 of 24
30. (load-truck package3 truck4 s1)
   deleted: (at package3 s1)
   added: (in package3 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 13 of 24
31. (drive-truck truck4 s1 s5 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (fuel-used) from 8441 to 9035
   goals met: 13 of 24
32. (unload-truck package3 truck4 s5)
   deleted: (in package3 truck4)
   added: (at package3 s5)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 14 of 24
33. (drive-truck truck4 s5 s1 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   changed: (fuel-used) from 9035 to 9575
   goals met: 14 of 24
34. (drive-truck truck3 s5 s1 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 9575 to 10655
   goals met: 13 of 24
35. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 14 of 24
36. (walk driver4 s0 p5-0)
   deleted: (at driver4 s0)
   added: (at driver4 p5-0)
   goals met: 14 of 24
37. (unload-truck package7 truck3 s1)
   deleted: (in package7 truck3)
   added: (at package7 s1)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 15 of 24
38. (walk driver4 p5-0 s5)
   deleted: (at driver4 p5-0)
   added: (at driver4 s5)
   goals met: 15 of 24
39. (drive-truck truck3 s1 s5 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 10655 to 11357
   goals met: 16 of 24
40. (board-truck driver4 truck2 s5)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 16 of 24
41. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 17 of 24
42. (drive-truck truck2 s5 s1 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 11357 to 11897
   goals met: 18 of 24
43. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 18 of 24
44. (walk driver4 s1 p1-2)
   deleted: (at driver4 s1)
   added: (at driver4 p1-2)
   goals met: 18 of 24
45. (walk driver4 p1-2 s2)
   deleted: (at driver4 p1-2)
   added: (at driver4 s2)
   goals met: 19 of 24
46. (drive-truck truck3 s5 s0 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 11897 to 12911
   goals met: 18 of 24
47. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 17 of 24
48. (drive-truck truck3 s0 s5 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 12911 to 13925
   goals met: 18 of 24
49. (drive-truck truck4 s1 s3 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 13925 to 13965
   goals met: 19 of 24
50. (drive-truck truck3 s5 s4 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 13965 to 14706
   goals met: 18 of 24
51. (unload-truck package11 truck3 s4)
   deleted: (in package11 truck3)
   added: (at package11 s4)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 19 of 24
52. (unload-truck package12 truck3 s4)
   deleted: (in package12 truck3)
   added: (at package12 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 20 of 24
53. (drive-truck truck3 s4 s5 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 14706 to 15276
   goals met: 21 of 24
54. (disembark-truck driver5 truck3 s5)
   deleted: (driving driver5 truck3)
   added: (at driver5 s5) (empty truck3)
   goals met: 21 of 24
55. (walk driver5 s5 p5-0)
   deleted: (at driver5 s5)
   added: (at driver5 p5-0)
   goals met: 21 of 24
56. (walk driver5 p5-0 s0)
   deleted: (at driver5 p5-0)
   added: (at driver5 s0)
   goals met: 22 of 24
57. (drive-truck truck4 s3 s5 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   changed: (fuel-used) from 15276 to 15806
   goals met: 21 of 24
58. (disembark-truck driver3 truck4 s5)
   deleted: (driving driver3 truck4)
   added: (at driver3 s5) (empty truck4)
   goals met: 21 of 24
59. (board-truck driver3 truck5 s5)
   deleted: (at driver3 s5) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 21 of 24
60. (drive-truck truck5 s5 s0 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   changed: (fuel-used) from 15806 to 16586
   goals met: 22 of 24
61. (disembark-truck driver3 truck5 s0)
   deleted: (driving driver3 truck5)
   added: (at driver3 s0) (empty truck5)
   goals met: 22 of 24
62. (walk driver3 s0 p0-1)
   deleted: (at driver3 s0)
   added: (at driver3 p0-1)
   goals met: 22 of 24
63. (walk driver2 s0 p5-0)
   deleted: (at driver2 s0)
   added: (at driver2 p5-0)
   goals met: 22 of 24
64. (walk driver3 p0-1 s1)
   deleted: (at driver3 p0-1)
   added: (at driver3 s1)
   goals met: 23 of 24
65. (walk driver2 p5-0 s5)
   deleted: (at driver2 p5-0)
   added: (at driver2 s5)
   goals met: 23 of 24
66. (board-truck driver2 truck4 s5)
   deleted: (at driver2 s5) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 23 of 24
67. (drive-truck truck4 s5 s3 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (fuel-used) from 16586 to 17116
   goals met: 24 of 24
